{
    "intro": {
        "text": "Why limit yourself? That is often a valid question, in my experience. I come to the field of software engineering with a wealth of experience in other areas – technical maintenance, customer services, ESL teaching, to name a few. I believe every lesson I learned there will be an asset now. Add to the mix a fluency in code gained at the age of eleven, as well as a deep fascination with various development practices such as object oriented design patterns, TDD and version control. It did take a few years to get there, but I don’t see how it could have happened any other way."
    },
    "education": [
        {
            "title": "Software engineering, Nackademin, Solna",
            "duration": "Sep 2022—ongoing",
            "description": "Most courses here are geared towards Java backend technologies, but languages and frameworks to me are tools and not goals in and of themselves. I will learn anything that is needed in a project to get the job done. Personal goals throughout these studies have been to focus on readability and maintainability of code, understanding the advantages of and gaining experience in test driven development, as well as laying a solid foundation when it comes to collaborating with other developers on various projects."
        },
        {
            "title": "Engelska, fristående kurser, Högskolan i Borås",
            "duration": "Augusti 2002—Maj 2003",
            "description": "Engelska A (30p), Engelska B (30p)"
        }
    ],
    "work": [
        {
            "title": "Servicetekniker, Selecta AB, Borås",
            "duration": "Januari 2019—Augusti 2022",
            "description": "När jag började min anställning som tekniker på Selecta satte jag ett mål: att höja kundnöjdheten på distriktet och korta ner inställelsetiderna till bra nivåer, detta med en övrig bemanning som nu var lägre än innan jag tillträdde. Trots till stora delar för mig obekant maskinpark nådde jag mitt mål inom två månader. Jag gjorde det genom hårt slit, smarta prioriteringar och en grundinställning att ingenting är omöjligt. Arbetet innefattade all form av teknisk fältservice, utbildning av kunder samt planering och utförande av större installationsprojekt."
        },
        {
            "title": "Servicetekniker, JOBmeal, Borås och Halland",
            "duration": "Februari 2012—Januari 2019",
            "description": "På JOBmeal var min roll oerhört bred – mitt ansvar för kunderna på distriktet omfattade allt utom nykundsbearbetning. Även orderhantering, renovering av utrustning och upplärning av ny personal låg på mitt bord. Mitt angreppssätt var alltid att tillsammans med mitt team skapa värde för kunden oavsett yttre omständigheter. De distriktsomläggningar, ägarbyten och omorganisationer som pågick i bakgrunden var inget våra kunder någonsin märkte av."
        }
    ],
    "other": [
        {
            "title": "Naturvårdsguide, Monkeyland Primate Sanctuary, Plettenberg Bay, Sydafrika",
            "duration": "September 2008—Januari 2009",
            "description": "Tjänstgjorde under fyra månader som svensk- och engelskspråkig guide. Guidade först i huvudsak svenska turister, men blev snabbt en av få icke infödda guider som fick förmånen att även ta emot inhemska grupper av skolbarn, större turistgrupper från hela världen och VIP-gäster. Fick under denna tid lära känna kulturen på nära håll, då många av mina kollegor bodde i den lokala kåkstaden med allt vad det innebar av fattigdom och marginalisering. En svårsmält men nyttig erfarenhet."
        }
    ]
}